package zhuk

import "strings"

var places = map[Type][]string{
	Simple: {"постели", "кровати", "подоконнике", "цветочках", "ботинке", "штанах", "душе", "земле", "кпп", "одеяле",
		"автобусе", "холодильнике", "кармане", "дома", "балконе", "ладошке", "руке", "ноге", "волосах", "навозе", "там",
		"машине", "трусах", "родине", "шкафом", "шкафу", "гардеробе", "туалете", "магазине", "землёй", "землей", "почве"},
	Ass:          {"жопе", "очке", "анусе", "соседей", "даче", "огороде", "россии", "украине", "молдове", "беларуси"},
	BlackRapper:  {"гетто", "тачке", "тёлки", "телке", "америке"},
	KPopper:      {"трусиках", "чонгука", "чон гука", "корее", "казахстане", "узкой щели"},
	GameDesigner: {"играх", "холлоунайте", "холлоу найте", "хеллоу несте", "араи", "кодзима", "штанах джейсона шраера"},
	Hercules:     {"качалке", "кочалке", "спортзале", "стероидах", "штанге", "турниках", "турничках", "фитнесе"},
	Fisher:       {"рыбе", "рыбалке", "прикормке", "снасти", "лодке", "проруби", "отдыхе", "пикнике", "водой"},
	Deutsch:      {"hause", "ich", "liebe", "deutschland", "rammstein", "wasser"},
	Alcoholic:    {"дне бутылки", "водке", "баре", "кбешке", "красном и белом", "кб", "полке", "ведре"},
	FilmCritic:   {"кино", "фильме", "сценарии", "кинокамере", "камере"},
	CProgrammer:  {"говнокоде", "багах", "коде", "исходном коде", "исходниках", "объектах", "облаках", "раю", "аду", "чистилище"},
	Cooker:       {"кухне", "кастрюле", "раковине"},
	Billionaire:  {"кошельке", "кармане зимней куртки"},
	Banker:       {"банке", "вкладе", "счету", "кредитке"},
	Lover:        {"любви"},
	Collector:    {"долгах", "шелках"},
	Homeless:     {"помойке", "свалке", "мусоре", "мусорном контейнере", "мусорке", "помойном ведре", "франции"},
	Butler:       {"дворце", "бетмена", "костюме", "этом чате"},
	Streamer:     {"твиче", "гудгейме", "васде", "ютубе", "интернете"},
	Courier:      {"улице", "доставке"},
	Farmer:       {"поле", "пшенице", "кукурузе", "тракторе", "сапогах", "марсе", "юпитере", "космосе"},
}

func Search(location string) (Type, bool) {
	str := strings.TrimSpace(strings.ToLower(location))

	// Trim prefixes.
	prefixes := []string{"в", "на", "у", "из", "к", "с"}
	for _, v := range prefixes {
		if strings.HasPrefix(str, v+" ") {
			str = strings.TrimSpace(str[len(v):])
			break
		}
	}

	// Find text.
	for k, vv := range places {
		for _, v := range vv {
			if str == v {
				return k, true
			}
		}
	}

	return Simple, false
}
